{"basics":{"name":"Sahil R. Rajpal","designation":"Backend Engineer","image":"","email":"sahilrajpal85@gmail.com","phone":"","summary":"Software engineer with a Bachelor’s in Computer Engineering, with nearly 3 years of experience, strong analytical skills, teamwork dedication, and a drive for tackling challenging projects to expand skill sets.","location":{"address":"","postalCode":"","city":"","countryCode":"IN","region":"Maharashtra"},"profiles":[{}]},"work":[{"name":"Pragma. (Formerly Logisy)","position":"Backend Engineer","url":"https://bepragma.ai","startDate":"2023-07-20","endDate":"","summary":"Spearheaded the development of 1Checkout, boosting user conversion rates by over 20% through the integration of multiple payment gateways and the implementation of key features. My efforts in optimizing system performance and engaging with merchants ensured a seamless user experience and product relevance.","highlights":["1Checkout Development: Spearheaded the development of 1Checkout, enhancing user conversion rates by over 20%. Integrated various payment gateways including PhonePe, Razorpay, Snapmint, and Cashfree.","Feature Implementation: Built features like partial COD, shipping, and blacklisting of emails, phone numbers, and cities. Improved user experience and reduced cart abandonment rates.","System Optimization: Conducted thorough code reviews, implemented code optimizations, and ensured adherence to PEP8 standards, resulting in improved system performance and maintainability.","Customer Interaction: Engaged with merchants on calls to gather feedback and built features based on their needs, enhancing product relevance and user satisfaction.","Collaboration and UX Enhancement: Actively collaborated with cross-functional teams to brainstorm and implement UX improvements, shaping the direction of the project.","Crisis Management: Successfully navigated critical production failures, demonstrating strong multitasking abilities and effective problem-solving skills."]},{"name":"FactWise","position":"Founding Engineer","url":"https://factwise.io","startDate":"2021-07-19","endDate":"2023-07-19","summary":"At FactWise, I led the development of a comprehensive source-to-pay system, owning over 90% of the backend modules. My focus on clean code principles, effective collaboration with stakeholders, and direct customer interactions enhanced procurement efficiency and product usability.","highlights":["Source to Pay System: Designed and implemented a comprehensive source-to-pay system, streamlining procurement processes and improving efficiency.","Backend Development Leadership: Owned and developed over 90% of the modules, including events, negotiation, purchase orders, draft purchase orders, invoices, quality checks, goods receipts, admin panel, notification configurations, and approval flows.","Quality and Code Maintenance: Adhered to clean code principles, enhancing the accuracy, modularity, and overall quality of the codebase.","Team Collaboration: Worked closely with product management and engineering stakeholders to ensure efficient implementation strategies and high-quality deliverables.","Task Management: Assigned tasks to team members based on their strengths and monitored progress to ensure timely completion of projects.","Mentorship: Mentored PM interns and dev interns, helping them ramp up, understand team dynamics, and learn to ask the right questions.","Customer Interaction: Engaged with merchants on calls to understand their requirements and built features tailored to their needs, improving product usability and customer satisfaction."]}],"volunteer":[],"education":[{"institution":"Vivekanand Education Society's Institute of Technology","location":"Mumbai, Maharashtra","url":"https://vesit.ves.ac.in/","area":"Computer Engineering","studyType":"B.E.","startDate":"2017-08-01","endDate":"2021-10-06","score":"8.54"}],"awards":[],"certificates":[{"name":"Advanced Python","date":"2021-01-21","issuer":"Cutshort","url":"https://cutshort.io/certificate/33321","icon":"fa-solid fa-location-dot"}],"publications":[],"skills":[{"name":"Python","icon":"fa-solid fa-hashtag"},{"name":"Django REST","icon":"fa-solid fa-hashtag"},{"name":"FastAPI","icon":"fa-solid fa-hashtag"},{"name":"PostgreSQL","icon":"fa-solid fa-hashtag"},{"name":"Docker","icon":"fa-solid fa-hashtag"},{"name":"Celery","icon":"fa-solid fa-hashtag"},{"name":"Redis","icon":"fa-solid fa-hashtag"}],"interests":[],"references":[],"projects":[{"name":"Sitechecker","summary":"A web-based platform for real-time service monitoring with customizable alerting plugins","highlights":["Infrastructure Monitoring Platform: Developed a free, open-source, and self-hosted infrastructure monitoring platform capable of monitoring various services. Implemented alerting mechanisms, including SMS, E-mail, and Telegram alerts, to notify users in case of service misbehavior or downtime.","Extensible Plugin Functionality: Incorporated extensible plugin functionality, enabling the creation of separate alerting and monitoring modules to cater to diverse monitoring needs.","Scalable Dockerized Stateless Workers: Dockerized stateless workers, ensuring a scalable solution that can be easily expanded based on the number of monitoring checks required.","Efficient Task Distribution with Celery: Managed Celery workers for efficient task distribution, dynamically adjusting the workload based on the number of service checks to maintain optimal performance and responsiveness."],"startDate":"2020-04-01","endDate":"2020-06-01","url":"https://github.com/sahilr05/sitechecker"}]}